### chapter4 Datasets & Benchmarks

数据集通过提供具体问题的带有真值的样本，在许多研究领域的进展中发挥了关键作用。对不同的方法，定量评估提供了关于其能力和局限性的关键见解。计算机视觉领域的标志性例子包括双目和光流的Middlebury基准数据集[592]以及 PASCAL VOC不标识别挑战[197]。特别是这些数据集[592,197,28,243,92,396,134,364,602]还提供了在线评估服务器，允许对现有测试集进行公平的比较，并为该领域的研究人员提供了最新的技术现状概述。通过这种方式，研究团体可以很容易地确定当前的进展和剩余的挑战。

在自动驾驶汽车中，[243,134,364,495,7,175,396]引入了具有挑战性的基准，用于重建、运动估计、识别任务和跟踪，并有助于缩小实验室设置和具有挑战性的现实情况之间的差距。Kang等人[338]提供了自动驾驶环境下不同数据集和测试环境的详细概述。

仅仅在几年前，有几百个注释样例的数据集被认为足以解决许多问题。通过允许以监督的方式训练高容量的深度模型，引入包含成百上千个标记示例的数据集已经在许多计算机视觉学科中带来了惊人的突破。然而，收集大量带注释的数据并不是一件容易的事情，特别是对于像光流或语义分割这样需要像素级注释的任务。对于光流，Scharstein和Szeliski[592]和Baker等人在可控的实验室环境中使用耗时的程序获得密集的像素级注释，而Geiger等人[243]和Kondermann等人[364]只能提供真实街道的稀疏像素级注释，使用激光雷达扫描仪。Janai等人[322]采用一种不同的方法在任意真实场景中获得密集的像素级注释，利用高速摄像机在更简单的设置下解决光流问题。最近，使用Amazon的Mechanical Turk平台1进行众包已经在大规模数据集注释方面得到了推广，例如[162,425,396,470,175]。然而，通过Mechanical Turk获得的注释质量往往不够，通常需要在后处理和清理方面付出巨大努力。

现代计算机图形技术提供了一种替代手工注释的方法，允许生成具有像素级真值的大规模合成数据集。然而，创建逼真的虚拟世界既耗时又昂贵。尽管如此，电影和视频游戏的流行已经催生了一个创造非常逼真的3D内容的行业，这也孕育了用合成数据集完全取代真实数据的希望。因此，几个合成数据集[92,177,457,225,569]已经被提出并被人工智能研究人员使用。然而，所获得的现实性和多样性是否足以取代真实数据集，以及以合成数据为训练对象的模型是否能够泛化为真实数据输入，这仍然是一个有待解决的问题。挑战包括复杂的物体形状和外观，以及不利的环境条件，如直接照明，镜面反射，雾或雨。

研究一个系统在一段时间内的性能是自动驾驶汽车的另一个重要方面，例如在环境变化或罕见情况下的性能。在第4.2.6节中，我们讨论了几个用于长时间自动驾驶的最新数据集。虽然这些数据集中在环境变化上，但很难捕捉到一些罕见的情况，这些情况只能通过大量车辆在真实驾驶中记录下来。一个明显的例外是特斯拉的影子模式[659]的自动驾驶系统，这是一个休眠的日志模式，允许验证自动驾驶系统运行在真实和特别罕见的情况下在后台。

下面，我们将首先介绍与自动驾驶汽车相关的任务最流行的计算机视觉数据集和基准。之后，在第4.2节中，我们将重点关注专门用于自动驾驶汽车的数据集。我们还在表4.1中提供了计算机视觉中最流行的数据集的详细概述，并在下面讨论它们。

#### 4.1计算机视觉数据集

在本节中，我们将介绍与自动驾驶任务相关的最流行的计算机视觉数据集和基准。特别是，我们讨论了目标识别和跟踪、双目和三维重建和光流估计的数据集。

##### 4.4.1目标识别

大规模公共数据集的可用性，如ImageNet[162]、PASCAL VOC[197]和Microsoft COCO[425]，推动了新型计算机视觉算法的发展，特别是深度学习技术，用于对象分类、检测和语义分割等识别任务。

Everingham等人[197]在欧盟资助下创建的 PASCAL视觉目标挑战赛2(VOC)是目标分类、目标检测、目标分割和动作识别的基准。它包含了从Flickr上收集的具有挑战性的用户照片，并附有高质量的注释，在姿势、光照和遮挡方面具有很大的可变性。自引入以来，VOC挑战已经成为最流行的标杆识别算法测试平台之一。直到2012年PASCAL项目结束之前，它一直在适应社区的需要。多年来，该基准的规模不断扩大，在2012年达到了11,530张图像，其中包含27,450个标注对象。

2014年，Lin等人[425]引入了Microsoft COCO dataset3(图4.1)用于对象检测、实例分割和上下文推理。它们提供了复杂的日常场景的图像，其中包含了自然环境中的普通物体。该数据集包括91个对象类、250万个带注释的实例和328k张图像。在每个类的实例数上，Microsoft COCO比PASCAL VOC对象分割基准要大得多。所有对象都用每个实例分段进行了注释。

ImageNet[162]、PASCAL VOC[197]和Microsoft COCO[425]是迄今为止用于对象分类、检测和分割的最大和最多样化的数据集(表4.1)。

